; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-17)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	city0 - city
	city1 - city
	city2 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl2)
	(at plane2 city2)
	(fuel-level plane2 fl4)
	(at plane3 city1)
	(fuel-level plane3 fl4)
	(at plane4 city0)
	(fuel-level plane4 fl0)
	(at plane5 city2)
	(fuel-level plane5 fl1)
	(at plane6 city1)
	(fuel-level plane6 fl4)
	(at person1 city2)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city0)
	(at person6 city0)
	(at person7 city1)
	(at person8 city0)
	(at person9 city0)
	(at person10 city0)
	(at person11 city2)
	(at person12 city0)
	(at person13 city2)
	(at person14 city1)
	(at person15 city1)
	(at person16 city1)
	(at person17 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city0)
	(at plane3 city2)
	(at plane6 city1)
	(at person1 city2)
	(at person2 city0)
	(at person3 city1)
	(at person4 city1)
	(at person5 city1)
	(at person6 city0)
	(at person7 city2)
	(at person8 city0)
	(at person9 city0)
	(at person10 city0)
	(at person11 city2)
	(at person12 city0)
	(at person13 city1)
	(at person14 city2)
	(at person15 city2)
	(at person16 city0)
	))

)

; plan
1. (fly plane6 city1 city0 fl4 fl3)
   deleted: (at plane6 city1) (fuel-level plane6 fl4)
   added: (at plane6 city0) (fuel-level plane6 fl3)
   goals met: 9 of 19
2. (board person5 plane6 city0)
   deleted: (at person5 city0)
   added: (in person5 plane6)
   goals met: 9 of 19
3. (zoom plane6 city0 city1 fl3 fl2 fl1)
   deleted: (at plane6 city0) (fuel-level plane6 fl3)
   added: (at plane6 city1) (fuel-level plane6 fl1)
   goals met: 10 of 19
4. (debark person5 plane6 city1)
   deleted: (in person5 plane6)
   added: (at person5 city1)
   goals met: 11 of 19
5. (board person13 plane5 city2)
   deleted: (at person13 city2)
   added: (in person13 plane5)
   goals met: 11 of 19
6. (board person16 plane6 city1)
   deleted: (at person16 city1)
   added: (in person16 plane6)
   goals met: 11 of 19
7. (board person15 plane6 city1)
   deleted: (at person15 city1)
   added: (in person15 plane6)
   goals met: 11 of 19
8. (board person14 plane6 city1)
   deleted: (at person14 city1)
   added: (in person14 plane6)
   goals met: 11 of 19
9. (fly plane5 city2 city1 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 11 of 19
10. (debark person13 plane5 city1)
   deleted: (in person13 plane5)
   added: (at person13 city1)
   goals met: 12 of 19
11. (board person4 plane4 city0)
   deleted: (at person4 city0)
   added: (in person4 plane4)
   goals met: 12 of 19
12. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 12 of 19
13. (fly plane4 city0 city1 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 12 of 19
14. (debark person4 plane4 city1)
   deleted: (in person4 plane4)
   added: (at person4 city1)
   goals met: 13 of 19
15. (zoom plane3 city1 city2 fl4 fl3 fl2)
   deleted: (at plane3 city1) (fuel-level plane3 fl4)
   added: (at plane3 city2) (fuel-level plane3 fl2)
   goals met: 14 of 19
16. (board person7 plane6 city1)
   deleted: (at person7 city1)
   added: (in person7 plane6)
   goals met: 14 of 19
17. (zoom plane2 city2 city0 fl4 fl3 fl2)
   deleted: (at plane2 city2) (fuel-level plane2 fl4)
   added: (at plane2 city0) (fuel-level plane2 fl2)
   goals met: 15 of 19
18. (fly plane6 city1 city2 fl1 fl0)
   deleted: (at plane6 city1) (fuel-level plane6 fl1)
   added: (at plane6 city2) (fuel-level plane6 fl0)
   goals met: 14 of 19
19. (refuel plane6 city2 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 14 of 19
20. (debark person7 plane6 city2)
   deleted: (in person7 plane6)
   added: (at person7 city2)
   goals met: 15 of 19
21. (debark person15 plane6 city2)
   deleted: (in person15 plane6)
   added: (at person15 city2)
   goals met: 16 of 19
22. (debark person14 plane6 city2)
   deleted: (in person14 plane6)
   added: (at person14 city2)
   goals met: 17 of 19
23. (fly plane6 city2 city0 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl1)
   added: (at plane6 city0) (fuel-level plane6 fl0)
   goals met: 17 of 19
24. (refuel plane6 city0 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 17 of 19
25. (debark person16 plane6 city0)
   deleted: (in person16 plane6)
   added: (at person16 city0)
   goals met: 18 of 19
26. (fly plane6 city0 city1 fl1 fl0)
   deleted: (at plane6 city0) (fuel-level plane6 fl1)
   added: (at plane6 city1) (fuel-level plane6 fl0)
   goals met: 19 of 19
